jianpingwu1/betaflight_gd32/src/main/drivers/GD32/platform_mcu.h
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#pragma once

#if defined(GD32F425) || defined(GD32F450) || defined(GD32F460) || defined(GD32F470)

#include "gd32f4xx.h"

// Chip Unique ID on F4
#define U_ID_0 (*(uint32_t*)0x1fff7a10)
#define U_ID_1 (*(uint32_t*)0x1fff7a14)
#define U_ID_2 (*(uint32_t*)0x1fff7a18)

#ifndef GD32F4
#define GD32F4
#endif

#endif

#ifdef GD32F4

/* DMA data mode type */
typedef enum {
    DMA_DATA_MODE_SINGLE = 0,
    DMA_DATA_MODE_MULTI  = 1
} dma_data_mode_enum;

/* DMA general configuration struct */
typedef struct
{
    dma_data_mode_enum data_mode;
    dma_subperipheral_enum sub_periph;
    union {
        dma_single_data_parameter_struct init_struct_s;
        dma_multi_data_parameter_struct  init_struct_m;
    } config;
} dma_general_config_struct;

#endif

#ifdef GD32F4

#define USE_FAST_DATA

#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#define USE_ADC_INTERNAL
#define USE_USB_CDC_HID
#define USE_USB_MSC
#define USE_PERSISTENT_MSC_RTC
#define USE_MCO
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_LATE_TASK_STATISTICS


#define SET_BIT(REG, BIT)     ((REG) |= (BIT))
#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))
#define READ_BIT(REG, BIT)    ((REG) & (BIT))
#define CLEAR_REG(REG)        ((REG) = (0x0))
#define WRITE_REG(REG, VAL)   ((REG) = (VAL))
#define READ_REG(REG)         ((REG))
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))


#define I2C_TypeDef          void
#define I2C_HandleTypeDef    void
#define GPIO_TypeDef         void
#define GPIO_InitTypeDef     void
#define TIM_TypeDef          void
#define DMA_TypeDef          void
#define DMA_Stream_TypeDef   void
#define DMA_InitTypeDef      dma_single_data_parameter_struct
#define DMA_Channel_TypeDef  void
#define SPI_TypeDef          void
#define ADC_TypeDef          void
#define USART_TypeDef        void
#define TIM_OCInitTypeDef    timer_oc_parameter_struct
#define TIM_ICInitTypeDef    timer_ic_parameter_struct
#define TIM_OCStructInit     timer_channel_output_struct_para_init
#define TIM_Cmd              void
#define TIM_CtrlPWMOutputs   void
#define TIM_TimeBaseInit     void
#define TIM_TimeBaseInitTypeDef timer_parameter_struct
#define TIM_ARRPreloadConfig  void
#define EXTI_TypeDef         void
#define EXTI_InitTypeDef     void
#define USART_TypeDef        void

#define DMA0_CH0_BASE        (DMA0 + 0x10)
#define DMA0_CH1_BASE        (DMA0 + 0x28)
#define DMA0_CH2_BASE        (DMA0 + 0x40)
#define DMA0_CH3_BASE        (DMA0 + 0x58)
#define DMA0_CH4_BASE        (DMA0 + 0x70)
#define DMA0_CH5_BASE        (DMA0 + 0x88)
#define DMA0_CH6_BASE        (DMA0 + 0xA0)
#define DMA0_CH7_BASE        (DMA0 + 0xB8)

#define DMA1_CH0_BASE        (DMA1 + 0x10)
#define DMA1_CH1_BASE        (DMA1 + 0x28)
#define DMA1_CH2_BASE        (DMA1 + 0x40)
#define DMA1_CH3_BASE        (DMA1 + 0x58)
#define DMA1_CH4_BASE        (DMA1 + 0x70)
#define DMA1_CH5_BASE        (DMA1 + 0x88)
#define DMA1_CH6_BASE        (DMA1 + 0xA0)
#define DMA1_CH7_BASE        (DMA1 + 0xB8)



extern void gd32_timer_deinit(void *timer);
void gd32_timer_set_counter(void* timer, uint32_t counter);
#define TIM_DeInit           gd32_timer_deinit
#define TIM_SetCounter       gd32_timer_set_counter

#define UART_TX_BUFFER_ATTRIBUTE /* EMPTY */
#define UART_RX_BUFFER_ATTRIBUTE /* EMPTY */

#endif // GD32F4


#define GPIOA_BASE    GPIOA



#if defined(GD32F4)
#define TASK_GYROPID_DESIRED_PERIOD     125 // 125us = 8kHz
#define SCHEDULER_DELAY_LIMIT           10
#else
#define TASK_GYROPID_DESIRED_PERIOD     1000 // 1000us = 1kHz
#define SCHEDULER_DELAY_LIMIT           100
#endif

#define DEFAULT_CPU_OVERCLOCK 0

#if defined(GD32F4)
#define FAST_IRQ_HANDLER
#endif

#if defined(GD32F4)
// F4 can't DMA to/from TCM SRAM (where the stack lives)
// On G4 there is no specific DMA target memory
#define DMA_DATA_ZERO_INIT
#define DMA_DATA
#define STATIC_DMA_DATA_AUTO        static
#endif

#if defined(GD32F4)
// Data in RAM which is guaranteed to not be reset on hot reboot
#define PERSISTENT                  __attribute__ ((section(".persistent_data"), aligned(4)))
#endif

#ifdef USE_DMA_RAM

#else
#define DMA_RAM
#define DMA_RW_AXI
#define DMA_RAM_R
#define DMA_RAM_W
#define DMA_RAM_RW
#endif

#define USE_TIMER_MGMT
#define USE_TIMER_AF

#if defined(GD32F4)

#define IO_CONFIG(mode, speed, otype, pupd) ((mode) | ((speed) << 2) | ((otype) << 4) | ((pupd) << 5))

#define IOCFG_OUT_PP         IO_CONFIG(GPIO_MODE_OUTPUT, 0, GPIO_OTYPE_PP, GPIO_PUPD_NONE)  // TODO
#define IOCFG_OUT_PP_UP      IO_CONFIG(GPIO_MODE_OUTPUT, 0, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define IOCFG_OUT_PP_25      IO_CONFIG(GPIO_MODE_OUTPUT, GPIO_OSPEED_25MHZ, GPIO_OTYPE_PP, GPIO_PUPD_NONE)
#define IOCFG_OUT_OD         IO_CONFIG(GPIO_MODE_OUTPUT, 0, GPIO_OTYPE_OD, GPIO_PUPD_NONE)
#define IOCFG_AF_PP          IO_CONFIG(GPIO_MODE_AF,  0, GPIO_OTYPE_PP, GPIO_PUPD_NONE)
#define IOCFG_AF_PP_PD       IO_CONFIG(GPIO_MODE_AF,  0, GPIO_OTYPE_PP, GPIO_PUPD_PULLDOWN)
#define IOCFG_AF_PP_UP       IO_CONFIG(GPIO_MODE_AF,  0, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define IOCFG_AF_OD          IO_CONFIG(GPIO_MODE_AF,  0, GPIO_OTYPE_PP, GPIO_PUPD_NONE)
#define IOCFG_IPD            IO_CONFIG(GPIO_MODE_INPUT,  0, 0,             GPIO_PUPD_PULLDOWN)
#define IOCFG_IPU            IO_CONFIG(GPIO_MODE_INPUT,  0, 0,             GPIO_PUPD_PULLUP)
#define IOCFG_IN_FLOATING    IO_CONFIG(GPIO_MODE_INPUT,  0, 0,             GPIO_PUPD_NONE)
#define IOCFG_IPU_25         IO_CONFIG(GPIO_MODE_INPUT,  GPIO_OSPEED_25MHZ, 0, GPIO_PUPD_PULLUP)

#endif


#define FLASH_CONFIG_BUFFER_TYPE uint32_t


#if defined(GD32F4)
#define SPI_IO_AF_CFG           IO_CONFIG(GPIO_MODE_AF,  GPIO_OSPEED_50MHZ, GPIO_OTYPE_PP, GPIO_PUPD_NONE)
#define SPI_IO_AF_SCK_CFG       IO_CONFIG(GPIO_MODE_AF,  GPIO_OSPEED_50MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLDOWN)
#define SPI_IO_AF_SDI_CFG       IO_CONFIG(GPIO_MODE_AF,  GPIO_OSPEED_50MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define SPI_IO_CS_CFG           IO_CONFIG(GPIO_MODE_OUTPUT, GPIO_OSPEED_50MHZ, GPIO_OTYPE_PP, GPIO_PUPD_NONE)
#define SPI_IO_CS_HIGH_CFG      IO_CONFIG(GPIO_MODE_INPUT,  GPIO_OSPEED_50MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#else
#error "Invalid GD32 MCU defined - requires SPI implementation"
#endif

#if defined(GD32F4)
#define SPIDEV_COUNT 3
#else
#define SPIDEV_COUNT 4
#endif

// Work around different check routines in the libraries for different MCU types
#define CHECK_SPI_RX_DATA_AVAILABLE(instance) LL_SPI_IsActiveFlag_RXNE(instance)
#define SPI_RX_DATA_REGISTER(base) ((base)->DR)


#if defined(GD32F4)
#define MAX_SPI_PIN_SEL 2
#else
#error Unknown MCU family
#endif

#if defined(GD32F4)
#define USE_TX_IRQ_HANDLER
#endif

#if defined(GD32F4)
// all pins on given uart use same AF
#define UART_TRAIT_AF_PORT 1
#else
#error Unknown GD MCU when defining UART_TRAIT_x
#endif

#define PLATFORM_TRAIT_RCC 1


#if defined(GD32F4)
#define UARTHARDWARE_MAX_PINS 4
#endif

#if defined(GD32F4)
#define UART_REG_RXD(base) (USART_DATA((uint32_t)base))
#define UART_REG_TXD(base) (USART_DATA((uint32_t)base))
#endif


#if defined(GD32F4)
#define DMA_TRAIT_CHANNEL 1
#endif

#define SERIAL_TRAIT_PIN_CONFIG 1
#define USB_DP_PIN PA12


void systemClockSetHSEValue(uint32_t frequency);
extern void timerOCModeConfig(void *tim, uint8_t channel, uint16_t ocmode);
